DTCHull.run/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    atmosphere
    {
        type            patch;
        nFaces          798;
        startFace       2538618;
    }
    inlet
    {
        type            patch;
        nFaces          3192;
        startFace       2539416;
    }
    outlet
    {
        type            patch;
        nFaces          3192;
        startFace       2542608;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          798;
        startFace       2545800;
    }
    side
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          7056;
        startFace       2546598;
    }
    midPlane
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          27415;
        startFace       2553654;
    }
    hull
    {
        type            wall;
        inGroups        1(wall);
        nFaces          27438;
        startFace       2581069;
    }
)

// ************************************************************************* //
